'''''''''''''''''''''
1. Hello 출력하기
'''''''''''''''''''''

print('Hello')

'''''''''''''''''''''
2. Hello World 출력하기
'''''''''''''''''''''

print('Hello World')

'''''''''''''''''''''
3. Hello World 출력하기
(두 줄에 걸쳐 줄을 바꿔 출력하기)
'''''''''''''''''''''

# 방법 1
print('Hello\nWorld')
# 방법 2
print('''\
Hello
World
''')
# 방법 3
print("""\
Hello
World
""")

'''''''''''''''''''''
4. ‘Hello’ 출력하기
(단, 작은 따옴표도 함께 출력한다.)
'''''''''''''''''''''

print("'Hello World'")
# 큰따옴표 안에 작은 따옴표를 넣어주면 된다.

'''''''''''''''''''''
5. “Hello World” 출력하기
(단, 큰따옴표도 함께 출력한다.)
'''''''''''''''''''''

print('"Hello World"')

'''''''''''''''''''''
6. “!@#$%^&*()” 출력하기
(단, 큰따옴표도 함께 출력한다.)
'''''''''''''''''''''

print('"!@#$%^&*()"')

'''''''''''''''''''''
7. “C:\Download\hello.cpp” 출력하기
(단, 큰따옴표도 함께 출력한다.)
'''''''''''''''''''''

print('"C:\Download\hello.cpp"')

'''''''''''''''''''''
8. 아래 모양 출력하기
┌┬┐
├┼┤
└┴┘ 
'''''''''''''''''''''

print('''\
┌┬┐
├┼┤ 
└┴┘
''')
# 큰따옴표나 작은 따옴표 3개를 이용하면 된다.
